app/Controllers/Property.php

SELECT *
FROM `district`
SELECT *
FROM `banks`
SELECT *
FROM `firms`
---
    public function index()
    {

        $this->data['properties'] = $this->PropertyModel->getProperty();
        $this->data['districts'] = $this->DistrictModel->get()->getResultArray();
        $this->data['banks'] = $this->BankModel->get()->getResultArray();
        $this->data['firms'] = $this->FirmModel->get()->getResultArray();

SELECT *
FROM `district`
SELECT *
FROM `banks`
SELECT *
FROM `firms`
---
    public function view($id)
    {
        $this->data['property'] = $this->PropertyModel->getProperty($id);
        if (empty($this->data['property'])) {
            // show_404();
        }
        $this->data['properties'] = $this->PropertyModel->getProperty();
        $this->data['districts'] = $this->DistrictModel->get()->getResultArray();
        $this->data['banks'] = $this->BankModel->get()->getResultArray();
        $this->data['firms'] = $this->FirmModel->get()->getResultArray();