app/Models/PropertyModel.php

    public function getProperty($filter = FALSE) {
        $builder=$this->db->table('property p');
        $builder->select('p.id,tenure,property_address,north,east,date_of_val,acreage,rate_per_acre,property_value,serial_no, bank_option,user_status,user_option,p.notes,town_id,village_id,p.date_created,p.zone,p.c_east,p.c_north,p.category_id,p.date_modified,uv.salutation as valuer_salutation,uv.first_name as valuer_firstname,uv.last_name as valuer_lastname,uv.other_names as valuer_othernames,uv.initials as valuer_initials,uc.salutation as created_salutation,uc.first_name as created_first_name,uc.last_name as created_last_name,uc.other_names as created_other_names,um.salutation as modified_salutation,um.first_name as modified_firstname,um.last_name as modified_lastname,um.other_names as modified_othernames, bank_id,b. bank_name,district_id,d.district_name,p.firm_id,firm_name,status_name,p.status_id,valuer_id');
        $builder->join(' banks b', 'b.id=p. bank_id', 'left');
        $builder->join('users uv', 'uv.id=p.valuer_id', 'left');
        $builder->join('district d', 'd.id=p.district_id', 'left');
        $builder->join('firms frm', 'frm.id=p.firm_id', 'left');
        $builder->join('users uc', 'uc.id=p.created_by', 'left');
        $builder->join('users um', 'um.id=p.modified_by', 'left');
        $builder->join('status st', 'st.id=p.status_id', 'left');

        $builder->orderBy('p.id DESC');
        if ($filter === FALSE) {
            $query = $builder->get();
            return $query->getResultArray();
        } else {
            if (is_numeric($filter)) {
                $builder->where('p.id=' . $filter);
                $query = $builder->get();
                return $query->getRowArray();
            } else {
                $builder->where($filter);
                $query = $builder->get();
---
SELECT `p`.`id`, `tenure`, `property_address`, `north`, `east`, `date_of_val`, `acreage`, `rate_per_acre`, `property_value`, `serial_no`, `bank_option`, `user_status`, `user_option`, `p`.`notes`, `town_id`, `village_id`, `p`.`date_created`, `p`.`zone`, `p`.`c_east`, `p`.`c_north`, `p`.`category_id`, `p`.`date_modified`, `uv`.`salutation` as `valuer_salutation`, `uv`.`first_name` as `valuer_firstname`, `uv`.`last_name` as `valuer_lastname`, `uv`.`other_names` as `valuer_othernames`, `uv`.`initials` as `valuer_initials`, `uc`.`salutation` as `created_salutation`, `uc`.`first_name` as `created_first_name`, `uc`.`last_name` as `created_last_name`, `uc`.`other_names` as `created_other_names`, `um`.`salutation` as `modified_salutation`, `um`.`first_name` as `modified_firstname`, `um`.`last_name` as `modified_lastname`, `um`.`other_names` as `modified_othernames`, `bank_id`, `b`. `bank_name`, `district_id`, `d`.`district_name`, `p`.`firm_id`, `firm_name`, `status_name`, `p`.`status_id`, `valuer_id`
FROM `property` `p`
LEFT JOIN `banks` `b` ON `b`.`id`=`p`. `bank_id`
LEFT JOIN `users` `uv` ON `uv`.`id`=`p`.`valuer_id`
LEFT JOIN `district` `d` ON `d`.`id`=`p`.`district_id`
LEFT JOIN `firms` `frm` ON `frm`.`id`=`p`.`firm_id`
LEFT JOIN `users` `uc` ON `uc`.`id`=`p`.`created_by`
LEFT JOIN `users` `um` ON `um`.`id`=`p`.`modified_by`
LEFT JOIN `status` `st` ON `st`.`id`=`p`.`status_id`
ORDER BY `p`.`id` DESC
SELECT `p`.`id`, `tenure`, `property_address`, `north`, `east`, `date_of_val`, `acreage`, `rate_per_acre`, `property_value`, `serial_no`, `bank_option`, `user_status`, `user_option`, `p`.`notes`, `town_id`, `village_id`, `p`.`date_created`, `p`.`zone`, `p`.`c_east`, `p`.`c_north`, `p`.`category_id`, `p`.`date_modified`, `uv`.`salutation` as `valuer_salutation`, `uv`.`first_name` as `valuer_firstname`, `uv`.`last_name` as `valuer_lastname`, `uv`.`other_names` as `valuer_othernames`, `uv`.`initials` as `valuer_initials`, `uc`.`salutation` as `created_salutation`, `uc`.`first_name` as `created_first_name`, `uc`.`last_name` as `created_last_name`, `uc`.`other_names` as `created_other_names`, `um`.`salutation` as `modified_salutation`, `um`.`first_name` as `modified_firstname`, `um`.`last_name` as `modified_lastname`, `um`.`other_names` as `modified_othernames`, `bank_id`, `b`. `bank_name`, `district_id`, `d`.`district_name`, `p`.`firm_id`, `firm_name`, `status_name`, `p`.`status_id`, `valuer_id`
FROM `property` `p`
LEFT JOIN `banks` `b` ON `b`.`id`=`p`. `bank_id`
LEFT JOIN `users` `uv` ON `uv`.`id`=`p`.`valuer_id`
LEFT JOIN `district` `d` ON `d`.`id`=`p`.`district_id`
LEFT JOIN `firms` `frm` ON `frm`.`id`=`p`.`firm_id`
LEFT JOIN `users` `uc` ON `uc`.`id`=`p`.`created_by`
LEFT JOIN `users` `um` ON `um`.`id`=`p`.`modified_by`
LEFT JOIN `status` `st` ON `st`.`id`=`p`.`status_id`
WHERE `p`.`id` = 6
ORDER BY `p`.`id` DESC
SELECT `p`.`id`, `tenure`, `property_address`, `north`, `east`, `date_of_val`, `acreage`, `rate_per_acre`, `property_value`, `serial_no`, `bank_option`, `user_status`, `user_option`, `p`.`notes`, `town_id`, `village_id`, `p`.`date_created`, `p`.`zone`, `p`.`c_east`, `p`.`c_north`, `p`.`category_id`, `p`.`date_modified`, `uv`.`salutation` as `valuer_salutation`, `uv`.`first_name` as `valuer_firstname`, `uv`.`last_name` as `valuer_lastname`, `uv`.`other_names` as `valuer_othernames`, `uv`.`initials` as `valuer_initials`, `uc`.`salutation` as `created_salutation`, `uc`.`first_name` as `created_first_name`, `uc`.`last_name` as `created_last_name`, `uc`.`other_names` as `created_other_names`, `um`.`salutation` as `modified_salutation`, `um`.`first_name` as `modified_firstname`, `um`.`last_name` as `modified_lastname`, `um`.`other_names` as `modified_othernames`, `bank_id`, `b`. `bank_name`, `district_id`, `d`.`district_name`, `p`.`firm_id`, `firm_name`, `status_name`, `p`.`status_id`, `valuer_id`
FROM `property` `p`
LEFT JOIN `banks` `b` ON `b`.`id`=`p`. `bank_id`
LEFT JOIN `users` `uv` ON `uv`.`id`=`p`.`valuer_id`
LEFT JOIN `district` `d` ON `d`.`id`=`p`.`district_id`
LEFT JOIN `firms` `frm` ON `frm`.`id`=`p`.`firm_id`
LEFT JOIN `users` `uc` ON `uc`.`id`=`p`.`created_by`
LEFT JOIN `users` `um` ON `um`.`id`=`p`.`modified_by`
LEFT JOIN `status` `st` ON `st`.`id`=`p`.`status_id`
WHERE (`north` IS NULL OR `north` = "") OR (`east` IS NULL OR `east` = "")
ORDER BY `p`.`id` DESC