app/Models/StaffModel.php

    public function getStaff($filter = false) {
        $builder= $this->db->table('users u');
        $builder->select('u.id,u.salutation,u.first_name,u.photo,u.pass_check as check,u.last_name,u.other_names,u.gender,u.email,u.status_id,u.role_id,r.role_name,u.date_created,u.initials,u.comment,st.status_name,u.branch_id,cr.first_name as createdby_firstname,cr.last_name as createdby_lastname,md.first_name as modifiedby_firstname,md.last_name as modifiedby_lastname,u.date_created,u.date_modified,u.firm_id,frm.firm_name,c.mobile_number,b.branch_name');
        $builder->join('users cr', 'cr.id=u.created_by', 'left');
        $builder->join('users md', 'md.id=u.modified_by', 'left');
        $builder->join('roles r', 'u.role_id=r.id','left');
        $builder->join('status st', 'st.id=u.status_id', 'left');
        $builder->join('firms frm', 'frm.id = u.firm_id', 'left');
        $builder->join('branches b', 'b.id = u.branch_id', 'left');
        $builder->join("$this->single_contact c", "c.user_id = u.id", "left");
        $builder->where('u.status_id!=9');
        $builder->orderBy('u.id DESC');
        if ($filter === FALSE) {
            $query = $builder->get();
---
SELECT `u`.`id`, `u`.`salutation`, `u`.`first_name`, `u`.`photo`, `u`.`pass_check` as `check`, `u`.`last_name`, `u`.`other_names`, `u`.`gender`, `u`.`email`, `u`.`status_id`, `u`.`role_id`, `r`.`role_name`, `u`.`date_created`, `u`.`initials`, `u`.`comment`, `st`.`status_name`, `u`.`branch_id`, `cr`.`first_name` as `createdby_firstname`, `cr`.`last_name` as `createdby_lastname`, `md`.`first_name` as `modifiedby_firstname`, `md`.`last_name` as `modifiedby_lastname`, `u`.`date_created`, `u`.`date_modified`, `u`.`firm_id`, `frm`.`firm_name`, `c`.`mobile_number`, `b`.`branch_name`
FROM `users` `u`
LEFT JOIN `users` `cr` ON `cr`.`id`=`u`.`created_by`
LEFT JOIN `users` `md` ON `md`.`id`=`u`.`modified_by`
LEFT JOIN `roles` `r` ON `u`.`role_id`=`r`.`id`
LEFT JOIN `status` `st` ON `st`.`id`=`u`.`status_id`
LEFT JOIN `firms` `frm` ON `frm`.`id` = `u`.`firm_id`
LEFT JOIN `branches` `b` ON `b`.`id` = `u`.`branch_id`
LEFT JOIN (SELECT `USER_ID`, `mobile_number` FROM `contact` WHERE `id` in (SELECT MAX(`id`) from `contact` GROUP BY `USER_ID`)) c ON `c`.`user_id` = `u`.`id`
WHERE `u`.`status_id` != 9
ORDER BY `u`.`id` DESC

    public function get_valued_by($filter = FALSE) {
        $builder = $this->db->table('users');
        $builder->select('id,first_name,last_name,other_names,salutation,initials');
        $builder->where('users.status_id in (1,4)');
        if ($filter === false) {
            $query = $builder->get();
---
SELECT `id`, `first_name`, `last_name`, `other_names`, `salutation`, `initials`
FROM `users`
WHERE `users`.`status_id` in (1,4)