app/Models/UserModel.php

SELECT `s`.*, `u`.`id` as `user_id`, `u`.`salutation`, `u`.`first_name`, `u`.`PHOTO`, `u`.`last_name`, `u`.`other_names`, `u`.`firm_id`
FROM `session_log` `s`
LEFT JOIN `users` `u` ON `s`.`user_id`=`u`.`id`
WHERE `u`.`status_id` != 9
ORDER BY `s`.`last_seen` DESC
---
    public function get_session_log($filter=FALSE) {
        $builder=$this->db->table('session_log s');
        $builder->select('s.*,u.id as user_id,u.salutation,u.first_name,u.PHOTO,u.last_name,u.other_names,u.firm_id');
        $builder->join('users u', 's.user_id=u.id', 'left');
        $builder->orderBy("s.last_seen","desc");
        if ($filter === FALSE) {
        $builder->where('u.status_id!=9');
            $query = $builder->get();